



export const outgoingAnalysis = {
  below: '내향적인 사람에게는 집중력과 독립적인 작업이 중요한 직업이 적합합니다. 연구원, 작가, 프로그래머, 그래픽 디자이너와 같은 직무를 추천합니다.',
  above: '외향적인 성향이 강한 사람에게는 사람들과의 소통이 중요한 직업이 잘 맞습니다. 마케팅, 영업, 이벤트 기획자, 상담사와 같은 직무를 추천합니다.',
  avg: 59
}

export const challengingAnalysis = {
  below: '안전성을 중요시하는 사람에게는 안정적이고 예측 가능한 환경을 제공하는 직업이 적합합니다. 공무원, 은행원, 회계사, 교사와 같은 직무를 추천합니다.',
  above: '도전성이 강한 사람에게는 끊임없는 변화와 높은 성취감을 제공하는 직업이 잘 맞습니다. 기업가, 투자 분석가, 탐험가, 프로젝트 매니저와 같은 직무를 추천합니다.',
  avg: 68,
}

export const regularityAnalysis = {
  below: '자유로운 것을 추구하는 사람에게는 창의적이고 유연한 업무 환경을 제공하는 직업이 잘 맞습니다. 예술가, 프리랜서 작가, 여행 블로거, 광고 기획자와 같은 직무를 추천합니다.',
  above: '규칙성을 중요시하는 사람에게는 정해진 절차와 일관된 업무 패턴을 제공하는 직업이 잘 맞습니다. 데이터 분석가, 행정 직원, 품질 관리 전문가, 도서관 사서와 같은 직무를 추천합니다.',
  avg: 45
}

export const actionAnalysis = {
  below: '아이디어를 제시하는 성향이 강한 사람에게는 창의력과 전략적 사고가 중요한 직업이 적합합니다. 컨설턴트, 광고 기획자, 연구원, 크리에이티브 디렉터와 같은 직무를 추천합니다.',
  above: '생각하는 것을 즉시 행동으로 옮기는 사람에게는 실행력과 결단력이 중요한 직업이 잘 맞습니다. 창업가, 이벤트 기획자, 프로젝트 매니저, 프로듀서와 같은 직무를 추천합니다.',
  avg: 53
}

export const readinessAnalysis = {
  below: '직업 준비도를 높이기 위해 먼저 자기평가를 진솔하게 하고 강점과 약점을 파악하세요. 그리고 관련된 기술을 향상시키고 산업 동향을 연구하며 실무 경험을 쌓기 위해 프로젝트나 인턴십에 참여해보세요. 이렇게 함께 경험을 쌓으면서 지속적인 개발과 학습으로 준비도를 향상시킬 수 있습니다.',
  above: '직업 준비도가 높은 사람에게는 지속적인 학습과 네트워킹이 성공의 열쇠입니다. 자신의 강점을 강화하고 변화하는 시장 트렌드를 주시하여 적응력을 키우세요.',
  avg: 49
}