
export const initAnswers = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0];


export const initQuestions = [
  {
    question: '나에게 좋은 회사란?',
    option1: '복지를 누리며, 마음이 맞는 동료와 일하는 곳',
    option2: '내가 기여한 만큼 금전적인 보상을 받는 곳'
  },
  {
    question: '취업준비 중, 두 회사에 붙었다. 나의 선택은?',
    option1: '나에게 안정성을 안겨줄 대기업',
    option2: '스톡옵션 도전! 함께 성장해나갈 스타트업'
  },
  {
    question: '내가 더 뿌듯하게 느끼는 것은??',
    option1: '나의 전문성이 증가했다는 느낌',
    option2: '다양한 사람들이 모여 하나의 큰 성과를 이뤘다는 점'
  },
  {
    question: '내가 열심히 준비한 프로젝트가 미뤄져서 여름 휴가와 겹쳤다',
    option1: '아십지만 휴가가 더 중요하다. 인수인계를 하고 떠난다.',
    option2: '휴가를 미루고 프로젝트부터 마무리한다.'
  },
  {
    question: '새로운 팀장님이 온다고 한다! 한 명을 고른다면?',
    option1: '일을 엄청 잘 하니느 않지만 6시 떙! 정시 퇴근하는 팀장님',
    option2: '업무 강도는 높지만 배울 점이 많은 워커홀링'
  }
]

export const outgoingQuestions = [
  '나는 많은 사람들 앞에서 이야기하는 것을 두려워하지 않는다.',
  '대화할 때 상대방의 말을 항상 잘 듣고 그말이 끝날 떄 까지 기다린다',
  '사람들을 도와줄 때 가장 행복하다',
  '나는 그룹 활동에 적극적으로 참여하는 편이다.',
  '내 옆에 아무도 없다는 생각이 들면 너무 힘들다',
  '나는 내 주변에 있는 사람들에게 영향력을 많이 미치는 편이다',
  '무슨일이 생기면 내가 가장 믿는 사람부터 찾는다',
  '나는 새로운 환경에 쉽게 적응하고 사람들과 빠르게 친해진다.',
  '나는 다른 사람들과 쉽게 친해질 수 있다.',
  '나는 사람들과의 상호작용을 통해 동기부여를 받는다.'
]

export const challengingQuestions = [
  '나는 발표기회가 생기면 먼저 나서서 발표를 한다.',
  '새로운 것을 학습하고, 그와 관련해서 더 깊이 있게 탐색 하는것을 즐긴다.',
  '내가 원하는 것을 얻기 위해 다른 사람을 이용하는 편이다',
  '평소에 긴장하거나 불안해하는 모습을 거의 보이지 않는다',
  '낮설고 불편하더라도 새로운 방식을 자주 시도해 보는 편이다.',
  '새로운 것을 학습하고, 그와 관련해서 더 깊이 있게 탐색 하는것을 즐긴다.',
  '나는 주변 사람들이 나의 이야기나 결정에 공감해주지 않아도 흔들리지 않는 편이다',
  '새로운 도전 과제에 대해 나는 흥분과 열정을 느낀다.',
  '어려운 목표를 설정하고 이를 달성하기 위해 노력한다.',
  '나는 실패를 두려워하지 않고, 실패를 통해 배우려고 한다.'
]

export const regularityQuestions = [
  '나는 다른 사람들보다 부지런한 편이다',
  '나는 부정적인 결과가 발생했을 때 주변 사람들보다 더 빨리 회복하는 편이다',
  '남에게 보여주기 위해 무리하게 돈을 쓰는 일은 거의 없다',
  '문서를 작성하거나 계산을 한 후에는 내용을 다시 확인한다',
  '중요한 순간일수록 침착하게 의사결정을 내리는 편이다',
  '나는 일정한 시간에 잠자리에 들고 일어나는 습관을 가지고 있다.',
  '나는 계획한 일정을 잘 지키려고 노력한다.',
  '나는 정해진 규칙을 따르는 것이 중요하다고 생각한다.',
  '나는 작업을 체계적으로 처리하는 편이다.',
  '나는 규칙적인 운동 습관을 유지하고 있다.'
]

export const actionQuestions = [
  '어려운 상황에 직면했을 때, 나는 대부분의 사람들보다 더 빨리 해결책을 찾는다.',
  '스트레스를 받는 상황에서도 나는 침착하게 행동할 수 있다.',
  '나는 실패를 경험한 후에도 빠르게 회복하여 다시 도전한다.',
  '나는 예상치 못한 변화에 유연하게 대처할 수 있다.',
  '비판을 받을 때, 나는 대부분의 사람들보다 덜 신경 쓴다.',
  '나는 문제가 발생했을 때 긍정적인 측면을 보려고 노력한다.',
  '나는 주어진 목표를 달성하기 위해 끈기 있게 노력한다.',
  '나는 일상적인 스트레스를 잘 관리한다.',
  '나는 어려운 사람들과의 관계도 잘 유지할 수 있다.',
  '긴급 상황에서 나는 신속하고 효과적으로 대응한다.'
]

export const readinessQuestions = [
  '현재 직무에 필요한 주요 기술을 충분히 갖추고 있다고 생각한다.',
  '나는 직무와 관련된 최신 트렌드와 발전에 대해 잘 알고 있다.',
  '직무에 필요한 교육과 자격증을 모두 취득했다.',
  '나는 업무 수행에 필요한 도구와 소프트웨어를 능숙하게 사용할 수 있다.',
  '현재 직무와 관련된 실무 경험이 충분하다고 생각한다.',
  '나는 직무에서 발생할 수 있는 문제를 효과적으로 해결할 수 있는 능력을 가지고 있다.',
  '나는 직무 수행에 필요한 의사소통 능력을 충분히 갖추고 있다.',
  '나는 팀 내에서 효과적으로 협력하고 기여할 수 있다.',
  '직무를 성공적으로 수행하기 위해 필요한 시간 관리 능력을 가지고 있다.',
  '나는 직무 수행에 있어 높은 수준의 책임감을 느낀다.'
]
